Repository: OrbintSoft/yauaa.netcore
Catalog: src/OrbintSoft.Yauaa.WebSample.AspNetCore/Resources/Views.Home.Guide.*.resx
Languages: it

source: How to use Yauaa for .NET Standard
it: Come usare Yauaa per .NET standard

source: Introduction
it: Introduzione

source: For most common devices we provide a lookup table in yaml file to identify device brand/model based on the few info available in the user agent.
it: Per i dispositivi più comuni utilizziamo una tabella di lookup definita in file .yaml per identificare marca e modello del dispositivo utilizzando le poche informaini disponibili nello user agent.

source: or on his Java repository on github:
it: o sul suo repository Java su github:

source: Original project
it: Progetto originale

source: Thanks to custom yaml definitions, you can make the library able to identify your company applications/ tools and extract your custom fields.
it: Grazie a a definizioni yaml personalizzate. puoi rendere la libreria in grado di identificare le tue applicazioni e tool aziendiali con campi personalizzati.

source: That makes the library very fast, flexible and easy to mantain, on the contrary the library can't extract info that are not present on user agent string without a proper mapping.
it: Ciò rende la libreria molto veloce, flessibile e facile da mantenere, per contro non siamo in grado di estrarre informazioni che non sono presenti nella stringa dello user agent senza una mappatura apposita.

source: The library aims to provides a reliable and extensible user agent parsing, browser and device detection.
it: Lo scopo della libreria è fornire un parsing/analisi dello user agent facilmente estensibile e personalizzabile, in grado di identificare sia il browser che il dispositivo.

source: The library can be easily extended thanks to yaml files and a simple syntax (we don't rely on regular expression).
it: La libreria può essere facilmente estesa grazie a file yaml e a una sintassi molto semplice (non dipendiamo da regular expression).

source: The library doesn't aim to recognize every device in the world (there are several thousands), but it is able to work, analyze and extract all attributes available in the user agent.
it: Lo scopo della libreria non è identificare tutti i dispositivi al mondo (ce ne sono diverse migliaia), ma è di essere in grado di analizzare ed estrarre tutti gli attributi disponibili a partire dallo user agent.

source: This is a .NET standard library that tries to parse and analyze the user agent string and extract as many relevant attributes as possible.
it: Questa è una libreria scritta per .NET standard che prova ad analizzare lo user agent ed estrarre quanti più attributi possibili.

source: This is a semantic analyzer, so it doesn't rely on any database (except for some very little lookup tables), that means it is able to parse and recognize every day new kind of user agents and new patterrsns without updates.
it: Questo è un analizzatore semantico che non dipende da nessuna base dati (ad eccezione di alcune piccole tabelle), questo significa che è in grado di analizzare e riconoscere ogni giorno nuovi tipi di user agent e pattern senza aggiornamenti.

source: This library has been built thanks to the effort of Niels Basjes, you can find more on his blog post:
it: Questa libreria è stata sviluppata grazie agli sforzi di Niels Basjes, puoi trovare più informazioni a riguardo su questo blog:

source: As first step add this nuget package to your project:
it: Come primo step aggiungi questo pacchetto nuget al tuo progetto:

source: Before to start I suggest to try this
it: Prima di iniziare suggerisco di provare questa

source: Below you can see a sample of implementation:
it: Sotto puoi vedere un esempio di implementazione:

source: How to start
it: Come iniziare

source: Nuget Package
it: Pacchetto Nuget

source: Since the initialization of the analyzer can be very slow and you need to do just a single time, I suggest to create a singleton as support.
it: Poichè l'inizializzazione dell'analyzer può essere molto lenta e ed è necessario farla solo una volta, si succegerisce creare un sigleton di supporto.

source: The constructor is protected to hide the complex nature and initialization of the class, so to simplyfy the process you can take the advantage of a builder:
it: Il costruttore è protetto per nascondere l'inizializzazione e la natura complessa della classe, quindi per semplificare il processo puoi appoggiarti a un builder:

source: The library targets .NET standard 2.0, so it can be used on the following frameworks (higher versions are supported)
it: Questa libreria è scritta in .NET standard 2.0, quindi può essere usata sui seguenti frameworks (versioni più alte sono supportate)

source: To use the user agent analyzer you need to create an object of type UserAgentAnalyzer
it: Per usare il parser dello user agent, è necessario instanziare un oggetto di tipo UserAgentAnalyzer

source: and get all parsed fields with:
it: e ottenere tutti i campi parsati con:

source: As example you can read in asp.net the user agent string on the client with the following code:
it: Come esempio puoi leggere in asp.net la stringa dello user agent con il seguente codice:

source: Below a complete code sample:
it: Sotto un esempio di codice completo:

source: But since in most comon scenario you need to check some predefined fields, like OS, browser name or version, you can take the help of some defined constants:
it: Ma poichè negli scenari più comuni, probabilmente necessiterai di controllare solo alcuni campi predefiniti, come il sistema operativo, il nome del browser o la versione, puoi appoggiarti ad alcune costanti predefinite:

source: How interpret fields and values
it: Come interpretare i campi e i valori

source: How to parse
it: Come parsare

source: In facts you can define any custom fields to extract all info you need in Yaml files, that makes this analyzer extremly extensible and flexible
it: Di fatto puoi definire qualsiasi campo personalizzato ed estrarre tutte le informazioni di cui necessiti in file Yaml, questo rende lo User Agent estremamente estensibile e flessibile

source: Using the field name you can request the value of the field and receive an object of type AgentField:
it: Usando il nome del campo puoi richiederne il valore e ricevere un oggetto di tipo AgentField:

source: With GetValue() you can read the desidered value, while with GetConfidence() you get a number that shows how much is reliable the extracted field, a confidence < 0 means that parsing has failed and the extracted value is not reliable.
it: Con il metodo GetValue() puoi leggere il valore desiderato, mentre con GetConficence() ottieni un numero che indica quanto il campo estratto è affidabile. Una confidenza minore di 0 significa che l'analisi è fallita e il campo estratto non è affidabile.

source: Yauaa is a dynamic User Agent Analyzer that tryes to get any possible info from user agent, that means that there are no predefined fields like most of User Agent parser
it: Yauaa è un parser dello User Agent che prova ad ottenere qualsiasi informazione possibile dallo user agent, questo significa che non ci sono campi predenfiniti come la maggior parte delle librerie per parsare lo user agent

source: You can get a list of alla availables field in a user agent with:
it: Puoi ottenere una lista di tutti i campi disponibili per un dato user agent con:

source: You can parse the user agent simply calling:
it: Puoi parsare lo user agent semplicemente chiamando:

source: You can set all required configurations on the builder, and when you are ready, you just need to call the method Build();
it: Puoi impostare tutte le configurazioni richieste sul builder, e quando sei pronto, basta che chiami il metodo Build();

source: Below the possible values for DeviceClass enum
it: Sotto i possibili valori per l'enum DeviceClass

source: For this purpose you can take the advantage of the UserAgentClassifier class, let see an example:
it: Per questo scopo protrai utilizzare la classe UserAgentClassifier, vediamo un esempio:

source: How to classify
it: Come classificare

source: In a common use case you will need to classify user agents by their kind (mobile, tablet, bot, crawler, TV, etc...)
it: In un caso comune, avrai bisogno di classificare gli user agent in base alla loro tipologia (mobile, tablet, bot, crawler, TV, etc...)
